{
  "backend/main.mo": "Main backend actor managing projects, user profiles, authorization, storage mixins, and filtered project listing APIs.",
  "backend/migration.mo": "Migration module converting old project and profile formats to new structures with added settings and default values.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components and feature modules.",
  "frontend/index.css": "Root Tailwind CSS configuration defining theme variables, dark mode overrides, and base styling rules.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main React entry component providing theming, query client, error boundary, and authenticated routing.",
  "frontend/src/features/app-shell/CreatorDashboardLayout.tsx": "Dashboard layout with sidebar navigation, top bar, preview canvas, and section‑based control panels for creator tools.",
  "frontend/src/features/app-shell/SidebarNav.tsx": "Renders the sidebar navigation with section buttons and highlights the active item.",
  "frontend/src/features/app-shell/TopBar.tsx": "Displays the top navigation bar with project save handling, user menu, and project loading logic.",
  "frontend/src/features/audio/AnalysisStatus.tsx": "Shows audio analysis controls including sensitivity and frequency multipliers with sliders.",
  "frontend/src/features/audio/AudioEditingPanel.tsx": "Provides trim and fade controls for the loaded audio via sliders.",
  "frontend/src/features/audio/AudioUploadPanel.tsx": "Handles audio file upload and basic playback controls for the audio engine.",
  "frontend/src/features/audio/useAudioEngine.ts": "Implements a Zustand-powered audio engine handling loading, decoding, playback, trimming, and fades.",
  "frontend/src/features/auth/AuthGate.tsx": "Gates access to the app, showing login UI until the user is authenticated.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Prompts new users to enter and save their profile name in a modal dialog.",
  "frontend/src/features/background/BackgroundControlsPanel.tsx": "Provides UI to configure background type, colors, gradients, images, and particle settings.",
  "frontend/src/features/background/backgroundRenderers.ts": "Canvas helpers for rendering solid colors, linear gradients, and scaled images as backgrounds.",
  "frontend/src/features/background/particlesOverlay.ts": "Implements a particle overlay system with density, intensity controls and render/update logic.",
  "frontend/src/features/background/useBackgroundSettings.ts": "Zustand store managing background settings including colors, gradients, images, and particle options.",
  "frontend/src/features/errors/ErrorBoundary.tsx": "React error boundary that displays a styled fallback UI and allows page reload on error.",
  "frontend/src/features/export/exportEstimator.ts": "Provides rough estimates for export file size and render time plus formatting utilities.",
  "frontend/src/features/export/ExportPanel.tsx": "UI panel for configuring video export settings and showing estimated file size and render time.",
  "frontend/src/features/export/exportRenderer.ts": "Captures canvas frames and sequentially renders them into an array of image buffers.",
  "frontend/src/features/export/ffmpeg/ffmpegClient.ts": "Placeholder FFmpeg client simulating load and progress but throwing errors for actual video export.",
  "frontend/src/features/export/useExportQueue.ts": "Zustand store handling queued export jobs with status, progress, and job lifecycle controls.",
  "frontend/src/features/overlays/overlayRenderers.ts": "Canvas renderers for text, logo, and watermark overlays with animation, positioning, scaling, and shadow effects.",
  "frontend/src/features/overlays/OverlaysControlsPanel.tsx": "UI panel for editing overlay text, branding, font, position, size, animation, and logo settings.",
  "frontend/src/features/overlays/useOverlaySettings.ts": "Zustand store defining overlay settings, mutators, logo handling, and JSON serialization/deserialization.",
  "frontend/src/features/persistence/applyLoadedProject.ts": "Applies loaded project data to background, overlay, and visualizer settings via their stores.",
  "frontend/src/features/persistence/projectSettingsCodec.ts": "Encodes frontend background, branding, and tunnel settings strings into backend-compatible format with fallbacks.",
  "frontend/src/features/preview/PreviewCanvas.tsx": "React component rendering a canvas for visualizer preview and initializing the engine.",
  "frontend/src/features/projects/ProjectsPanel.tsx": "UI for listing, creating, and selecting projects with async queries and toast notifications.",
  "frontend/src/features/projects/useCurrentProject.ts": "Zustand store tracking the currently selected project ID.",
  "frontend/src/features/visualizer/modes/BarEqualizerHorizontal.ts": "Renders a horizontal bar equalizer with color‑coded bars based on audio data.",
  "frontend/src/features/visualizer/modes/BarEqualizerVertical.ts": "Renders a vertical bar equalizer centered horizontally using audio data.",
  "frontend/src/features/visualizer/modes/CircularSpectrum.ts": "Draws a circular spectrum of radial bars around the canvas center using audio frequencies.",
  "frontend/src/features/visualizer/modes/MinimalLofiGlow.ts": "Renders a soft radial glow and a simple waveform based on averaged audio amplitude.",
  "frontend/src/features/visualizer/modes/ParticleReactive.ts": "Generates reactive colored particles whose position and size vary with audio data.",
  "frontend/src/features/visualizer/modes/RadialNeonRing.ts": "Draws multiple neon radial rings with audio-driven point distortions and shifting hues.",
  "frontend/src/features/visualizer/modes/Tunnel3DWebGL.ts": "Implements a WebGL-based animated tunnel shader that reacts to audio levels.",
  "frontend/src/features/visualizer/modes/WaveformLine.ts": "Renders a simple continuous waveform line across the canvas using raw audio samples.",
  "frontend/src/features/visualizer/useVisualizerEngine.ts": "Manages visualizer engine state, initialization, audio linking, and mode/sensitivity updates.",
  "frontend/src/features/visualizer/VisualizerControlsPanel.tsx": "UI panel for selecting visualizer mode with WebGL checks and descriptive options.",
  "frontend/src/features/visualizer/VisualizerEngine.ts": "Main visualizer engine managing canvas rendering, modes, WebGL tunnel, audio analysis, and animation loop.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity persistence, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on user profiles and projects using the backend actor.",
  "frontend/src/index.css": "Defines global styles, color variables, and Tailwind layers for light and dark themes.",
  "frontend/src/lib/utils.ts": "Exports a cn function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/src/pages/CreatorDashboard.tsx": "Renders the creator dashboard wrapped in authentication and profile-setup flow.",
  "frontend/src/pages/LandingPage.tsx": "Implements the marketing landing page with login buttons, hero section, and feature highlights.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins.",
  "project_state.json": "Metadata describing project goals, architecture notes, implemented features, and current state version."
}