{
  "backend/main.mo": "Main actor handling access control, blob storage, user profiles, projects, templates, and query/mutation APIs with structured project types.",
  "backend/migration.mo": "Migration module upgrading old project records to include new published and isShared fields while preserving user profiles.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend application files.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React application.",
  "frontend/src/App.tsx": "Root React component configuring QueryClient, theme provider, error boundary, and routing between dashboard and landing page.",
  "frontend/src/features/app-shell/CreatorDashboardLayout.tsx": "Dashboard layout managing navigation, preview canvas, and context-specific control panels with mobile/desktop variants.",
  "frontend/src/features/app-shell/SidebarNav.tsx": "Sidebar navigation component listing sections including the new Creations/Templates area.",
  "frontend/src/features/app-shell/TopBar.tsx": "Top bar component handling project loading, saving, and user logout with settings serialization.",
  "frontend/src/features/audio/AnalysisStatus.tsx": "UI panel for adjusting audio analysis sensitivity and frequency multipliers.",
  "frontend/src/features/audio/AudioEditingPanel.tsx": "Provides trim and fade controls for loaded audio using sliders.",
  "frontend/src/features/audio/AudioUploadPanel.tsx": "Handles audio file upload, displays file info, and offers play/pause controls.",
  "frontend/src/features/audio/useAudioEngine.ts": "Zustand store managing audio loading, playback, trimming, fades, and analysis setup.",
  "frontend/src/features/auth/AuthGate.tsx": "Gates content behind Internet Identity authentication with login handling.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their display name.",
  "frontend/src/features/background/BackgroundControlsPanel.tsx": "UI for configuring background type, colors, gradients, images, and particle settings.",
  "frontend/src/features/background/backgroundRenderers.ts": "Canvas rendering helpers for solid, gradient, and image-based backgrounds.",
  "frontend/src/features/background/particlesOverlay.ts": "Implements a particle overlay that initializes, animates, and renders particles on a canvas with adjustable density and intensity.",
  "frontend/src/features/background/useBackgroundSettings.ts": "Defines a Zustand store managing background settings including colors, gradients, images, and particle options with serialization support.",
  "frontend/src/features/errors/ErrorBoundary.tsx": "React error boundary that displays a fallback UI with error details and a refresh button when a rendering error occurs.",
  "frontend/src/features/export/exportEstimator.ts": "Provides functions to estimate export file size and render time based on resolution, FPS, bitrate, and duration.",
  "frontend/src/features/export/ExportPanel.tsx": "UI panel for configuring video export settings and displaying estimated output, currently showing a placeholder notice for upcoming export functionality.",
  "frontend/src/features/export/exportRenderer.ts": "Captures canvas frames and renders a sequence of frames over time for video export purposes.",
  "frontend/src/features/export/ffmpeg/ffmpegClient.ts": "Placeholder FFmpeg client simulating load and progress but throwing an error since real FFmpeg.wasm support is unavailable.",
  "frontend/src/features/export/useExportQueue.ts": "Zustand store managing a queue of export jobs with enqueue, update, cancel, and removal operations.",
  "frontend/src/features/gallery/CreationsTemplatesPanel.tsx": "UI panel that displays templates and published creations, allowing users to create projects from templates.",
  "frontend/src/features/gallery/formatters.ts": "Utility functions for truncating principal IDs and formatting BPM values for display.",
  "frontend/src/features/overlays/overlayRenderers.ts": "Canvas rendering helpers that draw text, logos, and watermarks based on overlay settings and animation state.",
  "frontend/src/features/overlays/OverlaysControlsPanel.tsx": "UI panel for editing overlay text, branding, logo, and animation settings using useOverlaySettings.",
  "frontend/src/features/overlays/useOverlaySettings.ts": "Zustand store managing overlay text, font, position, animation, logo, and serialization/deserialization.",
  "frontend/src/features/persistence/applyLoadedProject.ts": "Applies project data by deserializing background, overlay, and visualizer settings into their respective stores.",
  "frontend/src/features/persistence/projectSettingsCodec.ts": "Encodes frontend JSON strings into backend-ready background, branding, and tunnel settings structures.",
  "frontend/src/features/preview/PreviewCanvas.tsx": "Canvas component that initializes the visualizer engine and displays a preview area.",
  "frontend/src/features/projects/ProjectsPanel.tsx": "Project management UI for creating, selecting, publishing, and listing projects.",
  "frontend/src/features/projects/useCurrentProject.ts": "Zustand store tracking and updating the currently selected project ID.",
  "frontend/src/features/visualizer/modes/BarEqualizerHorizontal.ts": "Renders a horizontal bar equalizer with 64 bars whose heights and colors reflect audio data.",
  "frontend/src/features/visualizer/modes/BarEqualizerVertical.ts": "Renders a vertical bar equalizer with centered bars sized based on audio intensity.",
  "frontend/src/features/visualizer/modes/CircularSpectrum.ts": "Draws a circular radial spectrum of bars around a center point based on audio frequencies.",
  "frontend/src/features/visualizer/modes/MinimalLofiGlow.ts": "Creates a soft glow and minimal waveform driven by the average audio amplitude.",
  "frontend/src/features/visualizer/modes/ParticleReactive.ts": "Generates reactive moving particles whose position, size, and color depend on audio data.",
  "frontend/src/features/visualizer/modes/RadialNeonRing.ts": "Renders multiple neon-colored radial rings of audio-reactive dots.",
  "frontend/src/features/visualizer/modes/Tunnel3DWebGL.ts": "Implements a WebGL animated tunnel effect using shaders with optional audio input.",
  "frontend/src/features/visualizer/modes/WaveformLine.ts": "Draws a simple waveform line across the canvas using normalized audio samples.",
  "frontend/src/features/visualizer/useVisualizerEngine.ts": "Provides React/Zustand store and hooks to initialize and control the VisualizerEngine.",
  "frontend/src/features/visualizer/VisualizerControlsPanel.tsx": "UI panel for selecting visualizer modes with WebGL support warnings and mode validation.",
  "frontend/src/features/visualizer/VisualizerEngine.ts": "Manages canvas-based audio visualizers, switching modes, handling analyzers, animation loops, and WebGL tunnel mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and projects via the actor API.",
  "frontend/src/index.css": "Global Tailwind and CSS variable setup defining light/dark themes and base styles.",
  "frontend/src/lib/utils.ts": "Utility to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/CreatorDashboard.tsx": "Creator dashboard wrapper with auth gating, profile setup, and main layout.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero, features, and login via Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, plugins, and animations.",
  "project_state.json": "Project metadata describing WaveCraft Pro goals, features, architecture notes, and versions."
}