{
  "backend/main.mo": "Motoko backend managing user profiles and CRUD operations for user-owned projects with access-control checks.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference list summarizing all frontend source files and their roles.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and light/dark mode styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component choosing LandingPage or CreatorDashboard based on Internet Identity authentication.",
  "frontend/src/features/app-shell/CreatorDashboardLayout.tsx": "Main creator dashboard layout with responsive sidebar, top bar, preview canvas, and context-sensitive control panels.",
  "frontend/src/features/app-shell/SidebarNav.tsx": "Sidebar navigation component listing creator tool sections with icons and active-state styling.",
  "frontend/src/features/app-shell/TopBar.tsx": "Renders the top navigation bar with save/export buttons and a user menu supporting logout and profile display.",
  "frontend/src/features/audio/AnalysisStatus.tsx": "Provides sliders to adjust audio analysis sensitivity and frequency band multipliers using the visualizer engine.",
  "frontend/src/features/audio/AudioEditingPanel.tsx": "Displays trim and fade controls for the loaded audio file, allowing adjustments via sliders.",
  "frontend/src/features/audio/AudioUploadPanel.tsx": "Handles audio file upload and basic playback controls, showing file info and play/pause actions.",
  "frontend/src/features/audio/useAudioEngine.ts": "Zustand store managing audio loading, playback, trimming, fades, and Web Audio API setup.",
  "frontend/src/features/auth/AuthGate.tsx": "Gates access to authenticated content, showing login UI or loading state as needed.",
  "frontend/src/features/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter and save their display name before continuing.",
  "frontend/src/features/background/BackgroundControlsPanel.tsx": "Placeholder panel for future background customization settings.",
  "frontend/src/features/errors/ErrorBoundary.tsx": "Error boundary that displays a fallback UI with error details and a refresh button.",
  "frontend/src/features/export/ExportPanel.tsx": "Placeholder panel for future MP4 export controls.",
  "frontend/src/features/overlays/OverlaysControlsPanel.tsx": "Placeholder panel for upcoming text and branding overlay controls.",
  "frontend/src/features/preview/PreviewCanvas.tsx": "Initializes and displays the visualizer canvas within a styled preview container.",
  "frontend/src/features/projects/ProjectsPanel.tsx": "Lists projects from the backend and provides a button to create new projects.",
  "frontend/src/features/visualizer/modes/BarEqualizerHorizontal.ts": "Renders a horizontal bar equalizer with 64 bars colored by frequency amplitude.",
  "frontend/src/features/visualizer/modes/BarEqualizerVertical.ts": "Renders a vertical bar equalizer centered horizontally with amplitude-based bar widths.",
  "frontend/src/features/visualizer/modes/CircularSpectrum.ts": "Draws a circular spectrum of radial bars representing audio frequencies.",
  "frontend/src/features/visualizer/modes/MinimalLofiGlow.ts": "Creates a soft glowing center pulse and minimal waveform based on average audio amplitude.",
  "frontend/src/features/visualizer/modes/ParticleReactive.ts": "Generates reactive particles whose positions and sizes respond to audio frequencies.",
  "frontend/src/features/visualizer/modes/RadialNeonRing.ts": "Renders multiple neon rings with particle-like points modulated by audio data.",
  "frontend/src/features/visualizer/modes/WaveformLine.ts": "Plots a simple waveform line across the canvas showing raw audio amplitude.",
  "frontend/src/features/visualizer/useVisualizerEngine.ts": "Zustand-powered hook connecting React to the visualizer engine, syncing mode and audio analyzer state.",
  "frontend/src/features/visualizer/VisualizerControlsPanel.tsx": "UI panel providing a select dropdown to choose visualizer modes using the visualizer engine store.",
  "frontend/src/features/visualizer/VisualizerEngine.ts": "Canvas-based engine that renders audio visualizations by mode, applying sensitivity and frequency band multipliers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor calls for user profiles and CRUD operations on projects.",
  "frontend/src/index.css": "Tailwind base and theme variable definitions configuring colors, typography, and dark mode styles.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge to merge class names.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/CreatorDashboard.tsx": "Creator dashboard page gated by authentication with profile setup and layout components.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, features, and login button using Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind config extending theme tokens, colors, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project goals, features, schema version, and image requirements."
}