{
  "kind": "build_request",
  "title": "Implement Vizzy-spec enhancements (aspect ratios, timeline, smoothing, autosave, sharing)",
  "projectName": "WaveCraft Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Add a canvas aspect-ratio system to the live preview and export settings with selectable presets: 16:9 (1280x720), 9:16 (1080x1920), and 1:1 (1080x1080). The preview must scale responsively to available space while preserving the selected aspect ratio, and the selected aspect ratio must be persisted in saved projects and restored on load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "Canvas System\n16:9 default (1280x720)\n9:16 option (1080x1920) for Shorts\n1:1 option for Instagram\nResponsive scaling preview",
          "Build now"
        ]
      },
      "acceptanceCriteria": [
        "In the creator UI, users can switch between 16:9, 9:16, and 1:1 and see the preview immediately resize without stretching.",
        "The preview maintains correct aspect ratio across mobile/tablet/desktop layouts without overlapping controls.",
        "Saving a project and then loading it restores the selected aspect ratio."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Implement an \"Animation smoothing\" control that reduces jitter in audio-reactive visuals by smoothing the analysis/derived amplitude signals used by the visualizer engine. The smoothing value must update the live preview immediately and be persisted in projects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Animation smoothing slider"
        ]
      },
      "acceptanceCriteria": [
        "A new slider labeled \"Animation Smoothing\" is available in an appropriate existing control panel (e.g., Audio Analysis / Visualizer controls).",
        "Increasing smoothing visibly reduces jittery motion; decreasing smoothing increases responsiveness.",
        "The value is saved with the project and restored on load."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Add best-effort beat detection output to the audio engine and expose beat events (timestamps) for UI and visualizer use, without degrading mobile performance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Extract:\nBass frequencies\nMid frequencies\nHigh frequencies\nBeat detection"
        ]
      },
      "acceptanceCriteria": [
        "When audio is loaded and played, the system computes beat events at best-effort quality and makes them available to the UI/visualizer engine.",
        "Beat detection can be enabled/disabled or has a lightweight mode so mid-range Android devices remain responsive."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Add a bottom timeline area in the creator UI that visualizes the loaded audio duration and current trim range, and can display beat markers derived from beat detection. The timeline must not block or overlap existing control panels on small screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Timeline at bottom",
          "Beat marker timeline"
        ]
      },
      "acceptanceCriteria": [
        "A timeline strip is visible at the bottom of the creator experience when audio is loaded.",
        "The timeline shows the full duration and indicates trim start/end (read-only visualization is acceptable if editing remains in existing trim controls).",
        "Beat markers appear on the timeline when beat detection is available.",
        "On mobile/tablet, the timeline remains usable and does not overlap the Audio Upload/Editing panels."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Upgrade the Audio Upload experience to include: drag-and-drop upload support, a max file size limit of 50MB with a clear validation error, and a basic waveform or amplitude preview after upload (lightweight and mobile-safe).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Max file size: 50MB\nDrag & drop support\nShow waveform preview after upload"
        ]
      },
      "acceptanceCriteria": [
        "Users can drag-and-drop an MP3/WAV onto the Audio Upload panel to load it.",
        "Files larger than 50MB are rejected with a clear English error message and no crash.",
        "After a successful upload, a waveform/amplitude preview is shown in the Audio Upload area (or immediately below it) without noticeable lag on mobile."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Implement project autosave every 30 seconds for authenticated users when a project is loaded/active and there are unsaved changes. Autosave must be network-efficient (avoid repeated saves when nothing changed) and provide clear UI feedback (e.g., \"Saving…\" / \"Saved\").",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Project auto-save every 30 seconds"
        ]
      },
      "acceptanceCriteria": [
        "When logged in and a project is active, the app autosaves at ~30s intervals only if settings have changed since the last save.",
        "Autosave does not interrupt playback/preview rendering and does not spam the backend when idle.",
        "The UI indicates autosave status in English (e.g., in the top bar)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Add a share-link capability for projects that generates a URL a user can copy. The share link must open a view that can load the shared/published project configuration for viewing (read-only is acceptable), and access must respect the existing published/shared flags on the backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Share link to project"
        ]
      },
      "acceptanceCriteria": [
        "Users can click a \"Share\" action for a project and copy a URL.",
        "Opening the URL in a new browser session loads the project configuration for viewing when the project is published/shared as intended.",
        "Attempting to open a share link for a non-shared/non-published project fails gracefully with a clear message (no sensitive data leak)."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Add a one-click \"YouTube-ready\" export preset that preconfigures export settings to 1280x720 (16:9) with sensible default FPS/bitrate, while keeping the existing export flow and estimates consistent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "One-click YouTube ready export (1280x720 optimized)"
        ]
      },
      "acceptanceCriteria": [
        "Export UI provides a \"YouTube-ready\" preset option that sets resolution to 720p (1280x720) and updates estimates immediately.",
        "The preset does not remove access to other export settings; it is just a quick configuration option."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Update the mobile UI to support a collapsible settings/controls area (while keeping the existing stacked layout), ensuring touch-friendly interaction and that the preview remains visible and usable without controls overlapping it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Mobile:\nStack layout\nCollapsible settings panel\nTouch optimized sliders"
        ]
      },
      "acceptanceCriteria": [
        "On mobile/tablet, users can collapse/expand the controls area to prioritize preview space.",
        "Controls remain scrollable and usable with touch; sliders have adequate touch targets.",
        "No overlap occurs between preview and controls in any collapsed/expanded state."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend changes there unless an explicit stable-state migration is required by a schema/state change.",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use only Internet Identity for authentication; do not add third-party auth systems.",
    "Do not introduce Node.js/Express, Firebase, MongoDB, server-side FFmpeg, or any external database/storage services."
  ],
  "nonGoals": [
    "Implement server-side video rendering or server-side export queues.",
    "Add subscription billing, plan gating, or monetization features.",
    "Implement full keyframe animation tooling beyond the requested beat markers/timeline visualization (unless separately requested later)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}