{
  "kind": "build_request",
  "title": "Add Creations/Templates gallery with built-in templates and published user projects",
  "projectName": "WaveCraft Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Add a new left-sidebar navigation section labeled \"Creations/Templates\" that opens a dedicated gallery view inside the existing creator dashboard layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12",
          "msg-14"
        ],
        "quotes": [
          "Yes",
          "Both",
          "All of them implant now"
        ]
      },
      "acceptanceCriteria": [
        "Sidebar shows a new item labeled \"Creations/Templates\" alongside existing sections.",
        "Selecting \"Creations/Templates\" renders a new gallery panel in the right controls area (desktop) and bottom sheet (mobile/tablet), consistent with the current section-switching behavior.",
        "All user-facing text for this section is in English."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Implement a Creations/Templates gallery UI that displays (1) built-in starter templates and (2) user-generated projects that are published/shared.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Yes",
          "Both"
        ]
      },
      "acceptanceCriteria": [
        "Gallery view contains two clearly separated lists (e.g., tabs): \"Templates\" and \"Creations\" (published projects).",
        "Templates list renders built-in templates with at minimum: name and a short description, and provides a primary action to use the template.",
        "Creations list renders published projects with at minimum: name, owner identifier (e.g., truncated principal), and BPM.",
        "Loading states and empty states are handled (e.g., \"No templates available\" / \"No published creations yet\")."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add backend support for built-in starter templates that can be listed by the frontend and used to create a new user project from a selected template.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Yes",
          "Both"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an API to list built-in templates (returning stable IDs and metadata needed by the gallery).",
        "Backend exposes an API to create a new project from a template ID (resulting project is owned by the caller and appears in the Projects list).",
        "Frontend calls the list-templates API to render the Templates list and calls the create-from-template API when the user selects \"Use template\".",
        "Using a template results in a newly created project that becomes selectable/active in the app (same behavior as creating a new project)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Add a publish/unpublish capability for projects, and ensure only published projects appear in the Creations/Templates gallery under user-generated creations.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-14"
        ],
        "quotes": [
          "All of them implant now"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a per-project published/shared flag (default: not published).",
        "Backend exposes APIs to publish and unpublish a project, enforcing that only the project owner (or admin) can change publish state.",
        "Backend exposes an API to list published projects for the gallery (only returns projects that are published).",
        "Frontend provides a clear UI control to publish/unpublish the currently selected project (or within the Projects panel), and the Creations list updates after changes (via React Query invalidation/refetch)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Update persistence/migration so existing saved projects upgrade safely with the new publish/shared field defaulting to not published.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-14"
        ],
        "quotes": [
          "All of them implant now"
        ]
      },
      "acceptanceCriteria": [
        "If existing stable state is present, upgrading does not trap and all existing projects gain the publish/shared field with a safe default (not published).",
        "After upgrade, listProjects and getProject continue to work for existing users/projects.",
        "No published projects appear unless explicitly published via the new API."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add React Query hooks and cache invalidation for templates listing, published creations listing, and publish/unpublish mutations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-14",
          "msg-15"
        ],
        "quotes": [
          "start the build",
          "Starting the build now."
        ]
      },
      "acceptanceCriteria": [
        "New hooks exist for: listing templates, listing published creations, publishing a project, unpublishing a project.",
        "After publish/unpublish, the Creations/Templates gallery reflects the new state without a full page reload.",
        "Errors from backend calls show a user-friendly English toast/message and do not break the dashboard."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Only create/update backend/migration.mo if needed for an upgrade of existing state; migration must be conditional and safe.",
    "Do not edit any frontend files under frontend/src/components/ui (shadcn components) or any other immutable paths listed in SYSTEM_CONTEXT.",
    "No monetization, subscriptions, Stripe, or plan-gating may be introduced."
  ],
  "nonGoals": [
    "Implementing a public anonymous gallery accessible without authentication.",
    "Social features (likes, comments, follows), external sharing links, or moderation workflows.",
    "Real-time updates (WebSockets) for the gallery."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}