{
  "kind": "build_request",
  "title": "Enable all “Coming Soon” options (Background, Text & Branding, 3D Tunnel, Export) and persist settings",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Replace the placeholder “Background controls coming soon” UI with fully functional Background controls, including: solid color background, multi-stop gradient background builder, image upload background, and a subtle animated particles overlay; all controls must update the live preview immediately without noticeable lag on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest",
          "msg-user-all"
        ],
        "quotes": [
          "start building  99.99 pursent accurate",
          "All",
          "Background controls coming soon"
        ]
      },
      "acceptanceCriteria": [
        "In the Background section, the placeholder text is removed and interactive controls are displayed for: solid color, multi-stop gradient, image upload, and particles overlay.",
        "Changing any Background control updates the PreviewCanvas immediately (no page reload).",
        "Uploaded background images are previewed correctly and can be replaced/cleared.",
        "Particles overlay can be enabled/disabled and its intensity/density can be adjusted.",
        "The Background controls are usable on small screens (Android Chrome), with touch-friendly inputs and no horizontal overflow."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Implement the Text & Branding (Overlays) controls to fully replace the “Overlay controls coming soon” placeholder, including: song title text, artist name text, font selection from bundled fonts, position controls, size controls, entrance animation preset selection, logo upload overlay, and an optional watermark toggle (default off); overlays must render in the live preview.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest",
          "msg-user-all"
        ],
        "quotes": [
          "All",
          "Overlay controls coming soon"
        ]
      },
      "acceptanceCriteria": [
        "In the Text & Branding section, the placeholder text is removed and controls exist for title, artist, font selection, position, size, entrance animation preset, logo upload, and watermark toggle (default off).",
        "Edits to title/artist/logo immediately appear in the PreviewCanvas.",
        "Logo upload supports common image formats and renders with correct aspect ratio (no stretching).",
        "Watermark is off by default and can be toggled on/off without any plan gating or paywalls.",
        "Overlays remain readable across backgrounds (e.g., via subtle shadow/outline or contrast-aware styling)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Implement the “3D Tunnel (Heavy)” visualizer mode as a real WebGL-based 3D tunnel mode (not a “coming soon” text stub), and provide a clear on/off performance-safe behavior so devices can switch away without crashes or memory leaks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest",
          "msg-user-all"
        ],
        "quotes": [
          "All",
          "3D Tunnel (Heavy)",
          "3D Tunnel mode (WebGL) - Coming soon"
        ]
      },
      "acceptanceCriteria": [
        "Selecting “3D Tunnel (Heavy)” produces an actual animated 3D tunnel visual rather than a “coming soon” message.",
        "Switching into and out of 3D Tunnel mode does not leak resources (no accumulating RAF loops, contexts, or GPU resources), and the preview continues to work after multiple toggles.",
        "3D Tunnel mode can be disabled gracefully on unsupported devices/browsers with a clear fallback message and automatic switch to a 2D mode."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Replace the placeholder Export panel (“Export controls coming soon”) with functional in-browser MP4 export UI and flow consistent with the existing Export feature set (ffmpeg.wasm, resolution/FPS/bitrate controls, time+size estimates, progress indicator, and client-side render queue).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "start building  99.99 pursent accurate",
          "Export controls coming soon"
        ]
      },
      "acceptanceCriteria": [
        "The Export panel shows real export controls (no placeholder text) and allows selecting resolution (720p/1080p/4K), FPS (30/60), and bitrate.",
        "Export shows estimated file size and render time before running (best-effort estimate).",
        "Export runs fully in-browser and displays progress throughout.",
        "Users can enqueue multiple export jobs, see job statuses, cancel a job, and jobs run sequentially client-side.",
        "Export failures are handled gracefully with an actionable error message and the app remains usable afterward."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Persist all newly-enabled “Coming Soon” settings (Background settings, Text & Branding settings, and 3D Tunnel mode selection/settings where applicable) in Projects so users can Save and later Load a project and see the same preview configuration restored.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-latest",
          "msg-user-all"
        ],
        "quotes": [
          "Add other options thats are in coming soon",
          "All"
        ]
      },
      "acceptanceCriteria": [
        "Backend Project model is extended to store background settings and overlay settings (and any necessary visualizer mode/settings) and returns them on getProject.",
        "A state migration is added only if required to preserve existing stored projects; existing projects continue to load successfully after upgrade.",
        "Frontend Save updates the current project with the new settings; Load applies those settings back into the UI and PreviewCanvas.",
        "No plan gating or subscription logic is introduced as part of persistence changes."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; generate backend/migration.mo only if a state upgrade is required to preserve existing data.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui; compose these components instead.",
    "Use English for any user-facing text.",
    "Keep all features unlocked; do not add subscriptions, Stripe, or any plan gating."
  ],
  "nonGoals": [
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding external databases or non-Motoko backend services.",
    "Implementing real-time features (WebSockets/chat/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}