{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Creations/Templates gallery in creator dashboard",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Add a new sidebar section labeled \"Creations/Templates\" that switches the dashboard controls panel to a dedicated gallery view.",
      "acceptanceCriteria": [
        "Sidebar shows a new item labeled \"Creations/Templates\" alongside existing sections.",
        "Selecting \"Creations/Templates\" renders a new gallery panel in the right controls area (desktop) and bottom sheet (mobile/tablet), consistent with the current section-switching behavior.",
        "All user-facing text for this section is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/app-shell/CreatorDashboardLayout.tsx",
          "operation": "modify",
          "description": "Extend NavSection to include the new Creations/Templates section and wire it into the existing section-switching renderControlsPanel flow so it appears in the right controls area and the mobile/tablet bottom panel."
        },
        {
          "path": "frontend/src/features/app-shell/SidebarNav.tsx",
          "operation": "modify",
          "description": "Add a new sidebar nav item labeled \"Creations/Templates\" that maps to the new NavSection id and behaves like existing items (active styling, click-to-switch)."
        },
        {
          "path": "frontend/src/features/gallery/CreationsTemplatesPanel.tsx",
          "operation": "create",
          "description": "Create the dedicated Creations/Templates gallery panel component to be rendered by CreatorDashboardLayout when the new section is active."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Implement the Creations/Templates gallery UI with separate Templates and Creations lists, including loading and empty states.",
      "acceptanceCriteria": [
        "Gallery view contains two clearly separated lists (e.g., tabs): \"Templates\" and \"Creations\" (published projects).",
        "Templates list renders built-in templates with at minimum: name and a short description, and provides a primary action to use the template.",
        "Creations list renders published projects with at minimum: name, owner identifier (e.g., truncated principal), and BPM.",
        "Loading states and empty states are handled (e.g., \"No templates available\" / \"No published creations yet\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/gallery/CreationsTemplatesPanel.tsx",
          "operation": "modify",
          "description": "Implement the UI with two separated views (e.g., tabs) for \"Templates\" and \"Creations\", render template cards (name, description, primary \"Use template\" action) and published project cards (name, truncated owner identifier, BPM), and include loading + empty states in English."
        },
        {
          "path": "frontend/src/features/gallery/formatters.ts",
          "operation": "create",
          "description": "Add small UI helpers for the gallery such as truncating principals/identifiers for display and formatting BPM values consistently."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Wire the gallery Templates list to backend template listing and support creating a new project from a selected template.",
      "acceptanceCriteria": [
        "Backend exposes an API to list built-in templates (returning stable IDs and metadata needed by the gallery).",
        "Backend exposes an API to create a new project from a template ID (resulting project is owned by the caller and appears in the Projects list).",
        "Frontend calls the list-templates API to render the Templates list and calls the create-from-template API when the user selects \"Use template\".",
        "Using a template results in a newly created project that becomes selectable/active in the app (same behavior as creating a new project)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for template listing and a create-from-template mutation that calls the corresponding backend capability; on success, invalidate the Projects list query and return the new project id."
        },
        {
          "path": "frontend/src/features/gallery/CreationsTemplatesPanel.tsx",
          "operation": "modify",
          "description": "Use the new templates listing hook to render Templates and call the create-from-template mutation from the \"Use template\" action; on success set the newly created project as current/active (same behavior as selecting a project) and show English success/error toasts."
        },
        {
          "path": "frontend/src/features/projects/useCurrentProject.ts",
          "operation": "modify",
          "description": "Ensure the current project store API supports setting the active project id from non-Projects panels (used after creating from a template), without introducing new routes."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend interface typings to include the template-listing and create-from-template backend capabilities used by the new hooks (keep types aligned with existing Template/ProjectSummary shapes)."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add UI controls to publish/unpublish projects and ensure the Creations list shows only published projects and updates after changes.",
      "acceptanceCriteria": [
        "Backend stores a per-project published/shared flag (default: not published).",
        "Backend exposes APIs to publish and unpublish a project, enforcing that only the project owner (or admin) can change publish state.",
        "Backend exposes an API to list published projects for the gallery (only returns projects that are published).",
        "Frontend provides a clear UI control to publish/unpublish the currently selected project (or within the Projects panel), and the Creations list updates after changes (via React Query invalidation/refetch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add hooks for listing published projects for the gallery, plus publish and unpublish mutations calling the corresponding backend capabilities; on success invalidate both the published-creations query and the Projects list query."
        },
        {
          "path": "frontend/src/features/projects/ProjectsPanel.tsx",
          "operation": "modify",
          "description": "Add a publish/unpublish control per project (or for the currently selected project) that calls the new publish/unpublish mutations, displays user-friendly English toast messages on success/failure, and preserves existing project selection behavior."
        },
        {
          "path": "frontend/src/features/gallery/CreationsTemplatesPanel.tsx",
          "operation": "modify",
          "description": "Render the Creations list using the published-projects listing hook so only published projects appear; ensure the list reflects publish state changes via React Query invalidation/refetch."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend interface typings to include backend capabilities for listing published projects and for publish/unpublish mutations used by the new hooks."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Add React Query hooks and cache invalidation for templates, published creations, and publish/unpublish mutations with user-friendly error handling.",
      "acceptanceCriteria": [
        "New hooks exist for: listing templates, listing published creations, publishing a project, unpublishing a project.",
        "After publish/unpublish, the Creations/Templates gallery reflects the new state without a full page reload.",
        "Errors from backend calls show a user-friendly English toast/message and do not break the dashboard."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Centralize the new React Query hooks (list templates, list published creations, publish, unpublish) with consistent query keys and invalidation, and ensure errors propagate cleanly for UI toast handling."
        },
        {
          "path": "frontend/src/features/gallery/CreationsTemplatesPanel.tsx",
          "operation": "modify",
          "description": "Add robust loading/empty/error UI states for both tabs and show English toast/messages for recoverable backend errors without breaking the dashboard layout."
        },
        {
          "path": "frontend/src/features/projects/ProjectsPanel.tsx",
          "operation": "modify",
          "description": "Ensure publish/unpublish UI uses the new hooks and provides user-friendly English error messages (toast) when backend calls fail, while keeping the panel interactive."
        }
      ]
    }
  ]
}