{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable Background, Text & Branding, 3D Tunnel, and Export; persist settings in Projects",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Replace Background placeholder with solid/gradient/image/particles controls that update the preview instantly and work well on mobile",
      "acceptanceCriteria": [
        "In the Background section, the placeholder text is removed and interactive controls are displayed for: solid color, multi-stop gradient, image upload, and particles overlay.",
        "Changing any Background control updates the PreviewCanvas immediately (no page reload).",
        "Uploaded background images are previewed correctly and can be replaced/cleared.",
        "Particles overlay can be enabled/disabled and its intensity/density can be adjusted.",
        "The Background controls are usable on small screens (Android Chrome), with touch-friendly inputs and no horizontal overflow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/background/BackgroundControlsPanel.tsx",
          "operation": "modify",
          "description": "Replace the placeholder UI with functional Background controls: solid color picker, multi-stop gradient builder (add/remove/reorder stops), background image upload/replace/clear, and particles overlay toggle + density/intensity controls. Use existing shadcn/ui inputs/components for touch-friendly mobile UX; ensure no horizontal overflow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/background/useBackgroundSettings.ts",
          "operation": "create",
          "description": "Create a Zustand store for background state (solid/gradient/image/particles) optimized for immediate preview updates (debounced only where needed) and mobile performance."
        },
        {
          "path": "frontend/src/features/background/backgroundRenderers.ts",
          "operation": "create",
          "description": "Add pure rendering helpers for solid color, multi-stop gradients, and background image draw logic (including safe object-URL lifecycle handling) to keep PreviewCanvas/engine lightweight."
        },
        {
          "path": "frontend/src/features/background/particlesOverlay.ts",
          "operation": "create",
          "description": "Implement a subtle, performance-safe 2D particles overlay renderer with adjustable density/intensity and deterministic cleanup (no leaking RAF loops)."
        },
        {
          "path": "frontend/src/features/preview/PreviewCanvas.tsx",
          "operation": "modify",
          "description": "Update PreviewCanvas to apply the background settings in the live preview (including background image and particles overlay layering) with immediate visual updates and mobile-safe sizing."
        },
        {
          "path": "frontend/src/features/visualizer/VisualizerEngine.ts",
          "operation": "modify",
          "description": "Refactor the 2D render pipeline to support compositing: background (solid/gradient/image), then visualizer, then optional particles overlay, without adding noticeable lag on mobile."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Replace Overlays placeholder with Text & Branding controls (title/artist/font/position/size/animation/logo/watermark) and render overlays in the preview",
      "acceptanceCriteria": [
        "In the Text & Branding section, the placeholder text is removed and controls exist for title, artist, font selection, position, size, entrance animation preset, logo upload, and watermark toggle (default off).",
        "Edits to title/artist/logo immediately appear in the PreviewCanvas.",
        "Logo upload supports common image formats and renders with correct aspect ratio (no stretching).",
        "Watermark is off by default and can be toggled on/off without any plan gating or paywalls.",
        "Overlays remain readable across backgrounds (e.g., via subtle shadow/outline or contrast-aware styling)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/overlays/OverlaysControlsPanel.tsx",
          "operation": "modify",
          "description": "Replace the placeholder with full overlay controls: song title, artist, bundled font selection, position controls, size controls, entrance animation preset selection, logo upload, and watermark toggle (default off). Use shadcn/ui controls for consistent touch-friendly UX. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/overlays/useOverlaySettings.ts",
          "operation": "create",
          "description": "Create a Zustand store for overlay state (title/artist/font/position/size/animation/logo/watermark) designed for immediate preview updates and predictable defaults (including watermark off)."
        },
        {
          "path": "frontend/src/features/overlays/overlayRenderers.ts",
          "operation": "create",
          "description": "Add canvas overlay render helpers (text with shadow/outline for readability, logo render with aspect-ratio preservation, entrance animation presets driven by time) to keep engine code modular."
        },
        {
          "path": "frontend/src/features/preview/PreviewCanvas.tsx",
          "operation": "modify",
          "description": "Wire overlay settings into the live preview so title/artist/logo/watermark render above the visualizer and remain readable across varied backgrounds."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Register bundled fonts (via @font-face declarations and font-family tokens) and ensure overlay text uses the selected font with safe fallbacks; keep user-facing text in English."
        },
        {
          "path": "frontend/public/assets/fonts/README.md",
          "operation": "create",
          "description": "Document where bundled font files should live and what names the font selector expects, so the app can ship with local font assets (no external fetch)."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Implement a real WebGL-based 3D Tunnel visualizer mode with safe toggling and fallback behavior",
      "acceptanceCriteria": [
        "Selecting “3D Tunnel (Heavy)” produces an actual animated 3D tunnel visual rather than a “coming soon” message.",
        "Switching into and out of 3D Tunnel mode does not leak resources (no accumulating RAF loops, contexts, or GPU resources), and the preview continues to work after multiple toggles.",
        "3D Tunnel mode can be disabled gracefully on unsupported devices/browsers with a clear fallback message and automatic switch to a 2D mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/visualizer/modes/Tunnel3DWebGL.ts",
          "operation": "create",
          "description": "Add a WebGL-based 3D tunnel renderer (3D game-style effect) with explicit init/render/dispose APIs for performance-safe toggling, including feature detection for WebGL support."
        },
        {
          "path": "frontend/src/features/visualizer/VisualizerEngine.ts",
          "operation": "modify",
          "description": "Replace the 3D Tunnel “coming soon” stub with integration that switches to the WebGL tunnel renderer when selected, and ensures proper cleanup (RAF, GPU resources) when switching away."
        },
        {
          "path": "frontend/src/features/visualizer/useVisualizerEngine.ts",
          "operation": "modify",
          "description": "Extend the visualizer engine hook to manage mode transitions safely (including creating/disposing WebGL resources) and expose a capability/fallback state for the UI."
        },
        {
          "path": "frontend/src/features/visualizer/VisualizerControlsPanel.tsx",
          "operation": "modify",
          "description": "Update the mode selection UX to show a clear fallback message when 3D Tunnel is unsupported and automatically switch to a 2D mode without breaking the preview. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/preview/PreviewCanvas.tsx",
          "operation": "modify",
          "description": "Adjust PreviewCanvas to support safe rendering surface management for both 2D canvas visuals and the WebGL 3D Tunnel mode (including resizing behavior and cleanup on unmount)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Replace Export placeholder with a functional in-browser MP4 export flow (ffmpeg.wasm) including controls, estimates, progress, and a sequential client-side queue",
      "acceptanceCriteria": [
        "The Export panel shows real export controls (no placeholder text) and allows selecting resolution (720p/1080p/4K), FPS (30/60), and bitrate.",
        "Export shows estimated file size and render time before running (best-effort estimate).",
        "Export runs fully in-browser and displays progress throughout.",
        "Users can enqueue multiple export jobs, see job statuses, cancel a job, and jobs run sequentially client-side.",
        "Export failures are handled gracefully with an actionable error message and the app remains usable afterward."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/export/ExportPanel.tsx",
          "operation": "modify",
          "description": "Replace the placeholder with export controls (resolution/FPS/bitrate), best-effort time+size estimates, queue UI (enqueue/cancel/status), and a robust progress indicator; keep all features unlocked (no gating). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/export/useExportQueue.ts",
          "operation": "create",
          "description": "Create a client-side sequential render queue store (enqueue, run sequentially, cancel, retry, status/progress) that keeps the app usable after failures."
        },
        {
          "path": "frontend/src/features/export/ffmpeg/ffmpegClient.ts",
          "operation": "create",
          "description": "Implement an ffmpeg.wasm wrapper for lazy-loading, progress reporting, error normalization, and safe teardown between jobs."
        },
        {
          "path": "frontend/src/features/export/exportEstimator.ts",
          "operation": "create",
          "description": "Add best-effort estimation utilities for expected file size and render time based on duration, resolution, FPS, and bitrate."
        },
        {
          "path": "frontend/src/features/export/exportRenderer.ts",
          "operation": "create",
          "description": "Add client-side frame capture/render orchestration from the live PreviewCanvas (or an offscreen render surface) into ffmpeg.wasm to produce MP4, reporting incremental progress and supporting cancellation."
        },
        {
          "path": "frontend/src/features/preview/PreviewCanvas.tsx",
          "operation": "modify",
          "description": "Expose a safe way for the export system to access the current render surface(s) for capture without interfering with live playback (e.g., via refs or a capture API)."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Persist Background, Text & Branding, and 3D Tunnel selections in Projects so Save/Load restores the same preview configuration",
      "acceptanceCriteria": [
        "Backend Project model is extended to store background settings and overlay settings (and any necessary visualizer mode/settings) and returns them on getProject.",
        "A state migration is added only if required to preserve existing stored projects; existing projects continue to load successfully after upgrade.",
        "Frontend Save updates the current project with the new settings; Load applies those settings back into the UI and PreviewCanvas.",
        "No plan gating or subscription logic is introduced as part of persistence changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/projects/useCurrentProject.ts",
          "operation": "create",
          "description": "Create a small store for current project selection (currentProjectId) and load/save orchestration state so Save/Load can consistently apply settings back into the UI and preview."
        },
        {
          "path": "frontend/src/features/projects/ProjectsPanel.tsx",
          "operation": "modify",
          "description": "Upgrade Projects UI from listing IDs to allowing selection and Load of a project; on selection, fetch project details and apply persisted background/overlay/tunnel settings to the corresponding Zustand stores and the visualizer mode."
        },
        {
          "path": "frontend/src/features/app-shell/TopBar.tsx",
          "operation": "modify",
          "description": "Wire the Save button to persist the current background/overlay/tunnel settings into the selected project, and provide clear success/error feedback without any gating. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align React Query hooks with the actual backend interface signatures and add mutations/queries needed for persistence: getProject, updateProject and/or targeted updateBackgroundSettings/updateBrandingSettings/updateTunnelSettings; ensure cache invalidation keeps UI/preview in sync."
        },
        {
          "path": "frontend/src/features/background/useBackgroundSettings.ts",
          "operation": "modify",
          "description": "Add serialize/deserialize helpers to map the newly enabled background controls into persisted project fields (using a backward-compatible encoding as needed) and apply on Load."
        },
        {
          "path": "frontend/src/features/overlays/useOverlaySettings.ts",
          "operation": "modify",
          "description": "Add serialize/deserialize helpers to map overlay controls (title/artist/font/position/size/animation/logo/watermark) into persisted project fields (using a backward-compatible encoding as needed) and apply on Load."
        },
        {
          "path": "frontend/src/features/visualizer/useVisualizerEngine.ts",
          "operation": "modify",
          "description": "Persist and restore the visualizer mode selection (including 3D Tunnel selection and any relevant settings) as part of project Save/Load, ensuring fallback logic still applies on unsupported devices."
        },
        {
          "path": "frontend/src/features/preview/PreviewCanvas.tsx",
          "operation": "modify",
          "description": "Ensure that when a project is loaded and stores are hydrated, the preview immediately reflects the restored background/overlays/visualizer mode without requiring a refresh."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update/verify frontend type definitions used by the UI so persisted settings for background/branding/tunnel are represented correctly in TypeScript and match the actor methods used by hooks."
        },
        {
          "path": "frontend/src/features/persistence/projectSettingsCodec.ts",
          "operation": "create",
          "description": "Add a small codec layer to version/encode/decode the newly enabled settings into the existing project settings fields in a migration-friendly way (so older projects can still load)."
        },
        {
          "path": "frontend/src/features/persistence/applyLoadedProject.ts",
          "operation": "create",
          "description": "Centralize Load behavior: given a fetched project, apply background/overlay/tunnel settings into the respective stores in a single place to avoid partial updates and keep preview consistent."
        }
      ]
    }
  ]
}